FemDesign.Bars.Buckling.BucklingLength
buckling_record

FemDesign.Bars.Buckling.BucklingLength.#ctor
Parameterless constructor for serialization.

FemDesign.Bars.Buckling.BucklingLength.#ctor(FemDesign.Bars.Buckling.Position,FemDesign.Bars.Buckling.BucklingType,System.Double,System.Boolean)
Constructor for flexural buckling length.

FemDesign.Bars.Buckling.BucklingLength.#ctor(FemDesign.Bars.Buckling.Position,FemDesign.Bars.Buckling.BucklingType,System.Double,FemDesign.GenericClasses.VerticalAlignment,System.Boolean)
Constructor for pressured flange buckling length.

FemDesign.Bars.Buckling.BucklingLength.#ctor(FemDesign.Bars.Buckling.Position,FemDesign.Bars.Buckling.BucklingType,FemDesign.GenericClasses.VerticalAlignment,System.Boolean,System.Boolean)
Constructor for lateral torsional buckling length.

FemDesign.Bars.Buckling.BucklingLength.FlexuralStiff(System.Double,System.Boolean)
Define BucklingLength in Flexural Stiff direction.
Remarks: Create
beta: Beta factor.
sway: Sway. True/false.
Returns:

FemDesign.Bars.Buckling.BucklingLength.FlexuralWeak(System.Double,System.Boolean)
Define BucklingLength in Flexural Weak direction.
Remarks: Create
beta: Beta factor.
sway: Sway. True/false.
Returns:

FemDesign.Bars.Buckling.BucklingLength.PressuredTopFlange(FemDesign.GenericClasses.VerticalAlignment,System.Double,System.Boolean)
Define BucklingLength for Pressured Top Flange.
Remarks: Create
beta: Beta factor.
loadPosition: "top"/"center"/"bottom"
continuouslyRestrained: Continuously restrained. True/false.
Returns:

FemDesign.Bars.Buckling.BucklingLength.PressuredBottomFlange(FemDesign.GenericClasses.VerticalAlignment,System.Double,System.Boolean)
Define BucklingLength for Pressured Bottom Flange.
Remarks: Create
beta: Beta factor.
loadPosition: "top"/"center"/"bottom"
continuouslyRestrained: Continuously restrained. True/false.
Returns:

FemDesign.Bars.Buckling.BucklingLength.LateralTorsional(FemDesign.GenericClasses.VerticalAlignment,System.Boolean,System.Boolean)
Define BucklingLength for Lateral Torsional buckling.
Remarks: Create
loadPosition: "top"/"center"/"bottom"
continouslyRestrained: Continously restrained. True/false.
cantilever: Cantilever. True/false.
Returns: